hobbi = (f"\tВ свободное время я занимаюсь йогой, она позволяет мне меньше нервничать и избавляться от неприятных"
         " мыслей.\n Люблю читать, cейчас «подсела» на фантастические романы в стиле ЛитРПГ.")
print('\tДобрый день, меня зовут Елена. По своей основной деятельности я банковский служащий в области кредитования\n '
      'юридических лиц. Работаю в банковской сфере уже 20 лет и мне стало уже скучно, поэтому я решилась освоить новую'
      ' профессию\n и стать программистом на Python.\n')
print(hobbi)
